Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceWarning
"%1s is not found. Please review the routing preference of %2s."

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceError
"%1s is not found. Please review the routing preference of %2s."

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedWarning
"In order to find a matching part, the fitting has to be connected to a pipe."

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedError
"In order to find a matching part, the fitting has to be connected to a pipe."

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.MaxPipeSizeReached
Maximum pipe size diameter reached during sizing

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.InvalidPipeSize
Pipe Size Table "[File Name]" is missing or invalid.

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.FabFittingFailed
The Fabrication Fitting was invalid

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeSizeMismatch
The duct/pipe size is invalid for the service definition

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeModified
The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CircularLoopInPipeSizing
Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.

Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CannotCreateGeometryForPipe
Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.

Autodesk.Revit.DB.BuiltInFailures.PipingFailures
Failures about Pipes.